Benchmark-Limitations/archive/limitations/accuracy-limited/monte_carlo_artillery.yaml
# limitations/call-limited/monte_carlo_artillery.yaml
config:
  phases:
    - duration: __DURATION__
      arrivalCount: __ARRIVALCOUNT__
  target: "https://<aws_lambda_or_gcp_function_url>"

scenarios:
  - flow:
      - post:
          url: "/"
          json:
            trials: __TRIALS__
          capture:
            - json: "$.uniqueId"
              as: uniqueId
            - json: "$.estimatedPi"
              as: estimatedPi
            - json: "$.trials"
              as: trials
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - log: |
          Unique ID: {{ uniqueId }},
          Pi: {{ estimatedPi }},
          Trials: {{ trials }}
    name: "Monte-Carlo"